IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
#include "camera_sd_storage.h"

#include "camera_snapshot_control.h"
#include "stm32f4xx_hal.h"

#include <stddef.h>

/*
 * Stage 11C-1 在既有冲突引脚切换成功后，将 PC8～PC12 和 PD2 配置为 SDIO AF12，
 * 并在 EXIT 时先将六个引脚退回 GPIO 输入态，再恢复 PC8、PC9、PC11 的 DCMI AF13。
 * PC8、PC9、PC11 同时被 DCMI 和 SDIO 使用，后续必须先停止 DCMI 和相关 DMA，
 * 再进入 SDIO 接管流程；本文件仍只验证复用切换，不初始化 SDIO 或 FATFS。
 */
static CameraSdStorageStatus_t s_camera_sd_status;

#define CAMERA_SD_CONFLICT_PIN_MASK \
    (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_11)
#define CAMERA_SD_CONFLICT_MODE_MASK \
    ((3UL << (8U * 2U)) | (3UL << (9U * 2U)) | (3UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_AF_MODE \
    ((2UL << (8U * 2U)) | (2UL << (9U * 2U)) | (2UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_SPEED_VERY_HIGH \
    CAMERA_SD_CONFLICT_MODE_MASK
#define CAMERA_SD_CONFLICT_PULLUP \
    ((1UL << (8U * 2U)) | (1UL << (9U * 2U)) | (1UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_AFRH_MASK \
    ((0xFUL << 0U) | (0xFUL << 4U) | (0xFUL << 12U))
#define CAMERA_SD_CONFLICT_AFRH_AF12 \
    ((12UL << 0U) | (12UL << 4U) | (12UL << 12U))
#define CAMERA_SD_CONFLICT_AFRH_AF13 \
    ((13UL << 0U) | (13UL << 4U) | (13UL << 12U))

#define CAMERA_SD_FULL_GPIOC_PIN_MASK \
    (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12)
#define CAMERA_SD_FULL_GPIOC_MODE_MASK \
    ((3UL << (8U * 2U)) | (3UL << (9U * 2U)) | \
     (3UL << (10U * 2U)) | (3UL << (11U * 2U)) | \
     (3UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_AF_MODE \
    ((2UL << (8U * 2U)) | (2UL << (9U * 2U)) | \
     (2UL << (10U * 2U)) | (2UL << (11U * 2U)) | \
     (2UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_PULLUP \
    ((1UL << (8U * 2U)) | (1UL << (9U * 2U)) | \
     (1UL << (10U * 2U)) | (1UL << (11U * 2U)) | \
     (1UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_AFRH_MASK \
    ((0xFUL << 0U) | (0xFUL << 4U) | (0xFUL << 8U) | \
     (0xFUL << 12U) | (0xFUL << 16U))
#define CAMERA_SD_FULL_GPIOC_AFRH_AF12 \
    ((12UL << 0U) | (12UL << 4U) | (12UL << 8U) | \
     (12UL << 12U) | (12UL << 16U))

#define CAMERA_SD_FULL_GPIOD_PIN_MASK GPIO_PIN_2
#define CAMERA_SD_FULL_GPIOD_MODE_MASK (3UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_AF_MODE (2UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_PULLUP (1UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_AFRL_MASK (0xFUL << 8U)
#define CAMERA_SD_FULL_GPIOD_AFRL_AF12 (12UL << 8U)

static uint32_t Camera_SDStorage_ReleaseConflictPins(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.conflict_pin_release_attempt_count;

    /* 只释放 PC8、PC9、PC11；不配置 PC10、PC12、PD2 或任何 SDIO 复用。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U))
    {
        ++s_camera_sd_status.conflict_pin_release_error_count;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.last_conflict_pin_error_code =
            CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
        s_camera_sd_status.last_conflict_pin_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
    }

    ++s_camera_sd_status.conflict_pin_release_success_count;
    s_camera_sd_status.conflict_pins_released = 1U;
    s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_conflict_pin_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_SwitchConflictPinsToSdioAf12(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_af12_switch_attempt_count;

    /* 只将 PC8、PC9、PC11 切换为 SDIO AF12，不处理 PC10、PC12、PD2。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    /* 进入复用态后已不再是 GPIO 输入释放态。 */
    s_camera_sd_status.conflict_pins_released = 0U;

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF12))
    {
        ++s_camera_sd_status.sdio_af12_switch_error_count;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.last_sdio_af12_error_code =
            CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
        s_camera_sd_status.last_sdio_af12_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
    }

    ++s_camera_sd_status.sdio_af12_switch_success_count;
    s_camera_sd_status.sdio_af12_selected = 1U;
    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_af12_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_LeaveSdioAf12ToInput(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_af12_restore_attempt_count;

    /* 只将 PC8、PC9、PC11 从 SDIO AF12 退回无上下拉的 GPIO 输入态。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U))
    {
        ++s_camera_sd_status.sdio_af12_restore_error_count;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.last_sdio_af12_error_code =
            CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
        s_camera_sd_status.last_sdio_af12_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
    }

    ++s_camera_sd_status.sdio_af12_restore_success_count;
    s_camera_sd_status.sdio_af12_selected = 0U;
    s_camera_sd_status.conflict_pins_released = 1U;
    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_af12_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_SwitchFullSdioGpioToAf12(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_full_gpio_switch_attempt_count;

    /* 配置 PC8、PC9、PC10、PC11、PC12 为完整 SDIO GPIO 的 AF12。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    /* 配置 PD2 为 SDIO_CMD 的 AF12，不访问 SDIO 外设。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_MODE_MASK) ||
        ((GPIOC->OTYPER & CAMERA_SD_FULL_GPIOC_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_FULL_GPIOC_AFRH_MASK) !=
         CAMERA_SD_FULL_GPIOC_AFRH_AF12) ||
        ((GPIOD->MODER & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_AF_MODE) ||
        ((GPIOD->PUPDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_PULLUP) ||
        ((GPIOD->OSPEEDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_MODE_MASK) ||
        ((GPIOD->OTYPER & CAMERA_SD_FULL_GPIOD_PIN_MASK) != 0U) ||
        ((GPIOD->AFR[0] & CAMERA_SD_FULL_GPIOD_AFRL_MASK) !=
         CAMERA_SD_FULL_GPIOD_AFRL_AF12))
    {
        ++s_camera_sd_status.sdio_full_gpio_switch_error_count;
        s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
        s_camera_sd_status.last_sdio_full_gpio_error_code =
            CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
        s_camera_sd_status.last_sdio_full_gpio_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
    }

    ++s_camera_sd_status.sdio_full_gpio_switch_success_count;
    s_camera_sd_status.sdio_full_gpio_af12_selected = 1U;
    s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_full_gpio_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_LeaveFullSdioGpioToInput(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

