IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    ++s_camera_sd_status.sdio_full_gpio_restore_attempt_count;

    /* 将 PC8～PC12 全部退回无上下拉的 GPIO 输入态。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    /* 将 PD2 同步退回 GPIO 输入态。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    s_camera_sd_status.sdio_af12_selected = 0U;
    s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;

    if (((GPIOC->MODER & CAMERA_SD_FULL_GPIOC_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) != 0U) ||
        ((GPIOD->MODER & CAMERA_SD_FULL_GPIOD_MODE_MASK) != 0U) ||
        ((GPIOD->PUPDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) != 0U))
    {
        ++s_camera_sd_status.sdio_full_gpio_restore_error_count;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.last_sdio_full_gpio_error_code =
            CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
        s_camera_sd_status.last_sdio_full_gpio_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
    }

    ++s_camera_sd_status.sdio_full_gpio_restore_success_count;
    s_camera_sd_status.conflict_pins_released = 1U;
    s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_full_gpio_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_RestoreConflictPins(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.conflict_pin_restore_attempt_count;

    /* 只把 PC8、PC9、PC11 恢复为 DCMI AF13，不重启 DCMI 或 DMA。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF13_DCMI;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF13))
    {
        ++s_camera_sd_status.conflict_pin_restore_error_count;
        s_camera_sd_status.conflict_pins_released = 1U;
        s_camera_sd_status.last_conflict_pin_error_code =
            CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
        s_camera_sd_status.last_conflict_pin_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
    }

    ++s_camera_sd_status.conflict_pin_restore_success_count;
    s_camera_sd_status.conflict_pins_released = 0U;
    s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_conflict_pin_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

void Camera_SDStorage_InitState(void)
{
    s_camera_sd_status.init_attempt_count = 0U;
    s_camera_sd_status.init_success_count = 0U;
    s_camera_sd_status.init_error_count = 0U;
    s_camera_sd_status.last_error_code = CAMERA_SD_OK;
    s_camera_sd_status.is_initialized = 0U;
    s_camera_sd_status.takeover_required = 1U;
    s_camera_sd_status.sdio_ready = 0U;
    s_camera_sd_status.fatfs_ready = 0U;
    s_camera_sd_status.last_operation_ms = 0U;
    s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_IDLE;
    s_camera_sd_status.takeover_enter_attempt_count = 0U;
    s_camera_sd_status.takeover_exit_attempt_count = 0U;
    s_camera_sd_status.takeover_enter_success_count = 0U;
    s_camera_sd_status.takeover_exit_success_count = 0U;
    s_camera_sd_status.takeover_error_count = 0U;
    s_camera_sd_status.last_takeover_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_takeover_operation_ms = 0U;
    s_camera_sd_status.takeover_precheck_required = 1U;
    s_camera_sd_status.takeover_precheck_attempt_count = 0U;
    s_camera_sd_status.takeover_precheck_success_count = 0U;
    s_camera_sd_status.takeover_precheck_fail_count = 0U;
    s_camera_sd_status.snapshot_pause_required = 1U;
    s_camera_sd_status.snapshot_pause_confirmed = 0U;
    s_camera_sd_status.conflict_pin_release_ready = 0U;
    s_camera_sd_status.last_takeover_precheck_error_code = CAMERA_SD_OK;
    s_camera_sd_status.conflict_pin_release_attempt_count = 0U;
    s_camera_sd_status.conflict_pin_release_success_count = 0U;
    s_camera_sd_status.conflict_pin_release_error_count = 0U;
    s_camera_sd_status.conflict_pin_restore_attempt_count = 0U;
    s_camera_sd_status.conflict_pin_restore_success_count = 0U;
    s_camera_sd_status.conflict_pin_restore_error_count = 0U;
    s_camera_sd_status.conflict_pins_released = 0U;
    s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_conflict_pin_operation_ms = 0U;
    s_camera_sd_status.sdio_af12_switch_attempt_count = 0U;
    s_camera_sd_status.sdio_af12_switch_success_count = 0U;
    s_camera_sd_status.sdio_af12_switch_error_count = 0U;
    s_camera_sd_status.sdio_af12_restore_attempt_count = 0U;
    s_camera_sd_status.sdio_af12_restore_success_count = 0U;
    s_camera_sd_status.sdio_af12_restore_error_count = 0U;
    s_camera_sd_status.sdio_af12_selected = 0U;
    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_af12_operation_ms = 0U;
    s_camera_sd_status.sdio_full_gpio_switch_attempt_count = 0U;
    s_camera_sd_status.sdio_full_gpio_switch_success_count = 0U;
    s_camera_sd_status.sdio_full_gpio_switch_error_count = 0U;
    s_camera_sd_status.sdio_full_gpio_restore_attempt_count = 0U;
    s_camera_sd_status.sdio_full_gpio_restore_success_count = 0U;
    s_camera_sd_status.sdio_full_gpio_restore_error_count = 0U;
    s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
    s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_full_gpio_operation_ms = 0U;
}

void Camera_SDStorage_GetStatus(CameraSdStorageStatus_t *status)
{
    if (status == NULL)
    {
        return;
    }

